Revit 2024 API
OrdinateDimensionLineStyle Enumeration
 The ordinate dimension line style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Since: 2017 Subscription Update
Syntax
C#
public enum OrdinateDimensionLineStyle
Visual Basic
Public Enumeration OrdinateDimensionLineStyle
Visual C++
public enum class OrdinateDimensionLineStyle
Members
Member name | Description
None |  Shows no dimension line. When you select the dimension line in the drawing area, a hidden line displays.
Continuous |  Displays the dimension line as continuous.
Segmented |  Segments the dimension line. Specify the length of the segments with the DimensionLineLength property.
See Also
Autodesk.Revit.DB Namespace